In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({
        'one': pd.Series(np.random.randn(3), index=['a', 'b', 'c']),
        'two': pd.Series(np.random.randn(4), index=['a', 'b', 'c', 'd']),
        'three': pd.Series(np.random.randn(3), index=['b', 'c', 'd'])})

In [4]:
df

        one       two     three
a  1.466165 -0.937541       NaN
b -1.494865 -0.838669  0.836497
c -1.149936 -0.227352  1.454821
d       NaN -0.309113  0.939658

In [5]:
df2 = df.copy()

In [6]:
df2

        one       two     three
a  1.466165 -0.937541       NaN
b -1.494865 -0.838669  0.836497
c -1.149936 -0.227352  1.454821
d       NaN -0.309113  0.939658

In [7]:
df.gt(df2)

     one    two  three
a  False  False  False
b  False  False  False
c  False  False  False
d  False  False  False

In [8]:
df2.ne(df)

     one    two  three
a  False  False   True
b  False  False  False
c  False  False  False
d   True  False  False

In [9]:
df.mean(axis = 0)

one     -0.392879
two     -0.578169
three    1.076992
dtype: float64

In [10]:
df.mean(axis = 1)

a    0.264312
b   -0.499012
c    0.025845
d    0.315272
dtype: float64

In [11]:
df_stand = (df - df.mean()) / df.std()
df_stand

        one       two     three
a  1.148132 -0.993575       NaN
b -0.680579 -0.720219 -0.726022
c -0.467553  0.969921  1.140616
d       NaN  0.743872 -0.414594

In [12]:
df_stand.std()

one      1.0
two      1.0
three    1.0
dtype: float64

In [13]:
df_stand.mean()

one     -1.850372e-17
two      0.000000e+00
three   -3.515706e-16
dtype: float64